MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX254F128D.atdf
         <register caption="USB BDT PAGE 3 Register" name="U1BDTP3" offset="0x290" rw="RW" size="4">
            <bitfield caption="BDT Base Address bits" mask="0x000000FF" name="BDTPTRU" values="U1BDTP3__BDTPTRU" />
         </register>
         <register caption="USB Configuration 1 Register" name="U1CNFG1" offset="0x2a0" rw="RW" size="4">
            <bitfield caption="Automatic Suspend Enable bit" mask="0x00000001" name="UASUSPND" values="U1CNFG1__UASUSPND" />
            <bitfield caption="Low-Speed Device Enable bit" mask="0x00000008" name="LSDEV" values="U1CNFG1__LSDEV" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00000010" name="USBSIDL" values="U1CNFG1__USBSIDL" />
            <bitfield caption="USB Eye-Pattern Test Enable bit" mask="0x00000040" name="UTEYE" values="U1CNFG1__UTEYE" />
         </register>
         <register caption="USB Endpoint 0 Control Register" name="U1EP0" offset="0x2c0" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP0__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP0__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP0__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP0__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP0__EPCONDIS" />
            <bitfield caption="Retry Disable bit (Host mode and U1EP0 only)" mask="0x00000040" name="RETRYDIS" values="U1EP0__RETRYDIS" />
            <bitfield caption="Low-Speed Direct Connection Enable bit (Host mode and U1EP0 only)" mask="0x00000080" name="LSPD" values="U1EP0__LSPD" />
         </register>
         <register caption="USB Endpoint 1 Control Register" name="U1EP1" offset="0x2d0" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP1__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP1__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP1__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP1__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP1__EPCONDIS" />
         </register>
         <register caption="USB Endpoint 2 Control Register" name="U1EP2" offset="0x2e0" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP2__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP2__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP2__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP2__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP2__EPCONDIS" />
         </register>
         <register caption="USB Endpoint 3 Control Register" name="U1EP3" offset="0x2f0" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP3__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP3__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP3__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP3__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP3__EPCONDIS" />
         </register>
         <register caption="USB Endpoint 4 Control Register" name="U1EP4" offset="0x300" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP4__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP4__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP4__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP4__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP4__EPCONDIS" />
         </register>
         <register caption="USB Endpoint 5 Control Register" name="U1EP5" offset="0x310" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP5__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP5__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP5__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP5__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP5__EPCONDIS" />
         </register>
         <register caption="USB Endpoint 6 Control Register" name="U1EP6" offset="0x320" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP6__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP6__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP6__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP6__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP6__EPCONDIS" />
         </register>
